import random
from random import randint
def z1():
    m=[randint(0,10) for i in range(5)]
    a=int(input("Введите число: "))
    if m.count(a):
        print(m, a, "Поздравляю, Вы угадали число!", sep='\n')
    else:
        print(m,a,"Нет такого числа!",sep='\n')
def z2():
    m = [randint(0, 10) for i in range(5)]
    m1=[]
    for i in range(5):
        a=m.count(m[i])
        if a>1 and m[i] not in m1:
            m1.append(m[i])
    if len(m1)==0:
        print(m, "Нет повторений", sep='\n')
    else:
        print(m, "Повторения: ", m1, sep='\n')
def z3():
    c=("Пн","Вт","Ср","Чт","Пт","Сб","Вс")
    a=int(input("Сколько выходных вы хотите? : "))
    k=a*(-1)
    m1=c[k:]
    m2=c[:k]
    print("Ваши выходные дни:", *m1)
    print("Ваши рабочие дни:",*m2)
def z4():
    c1=("Жаркова","Федосеева","Семёнов","Зарецкая","Печинская","Бутузова","Ярмолаш","Иванов","Дуничева","Бондарева")
    c2 = ("Павлова", "Пичуева", "Розина", "Иванов", "Горбачева", "Серебрякова", "Тимофеева", "Удовкин", "Федорчук", "Каширина")
    c3=tuple(random.sample(c1,5)+random.sample(c2,5))
    print("Исходные списки групп:", c1, c2, "Спортивная команда:", c3, "Длина кортежа:", len(c3), sep='\n')
    print("Спортивная команда(по алфавиту):", sorted(c3), sep='\n')
    if "Иванов" in c3:
        print("Иванов входит в команду")
        print("Фамилия встречается в кортеже:", c3.count("Иванов"), "раз")
    else:
        print("Иванов не входит в команду")

print("---Задача 1---")
z1()
print("---Задача 2---")
z2()
print("---Задача 3---")
z3()
print("---Задача 4---")
z4()

